Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: Give me something to eat.
jbo: ko dunda lo se citka mi

source: Please give me something to eat. I am so hungry.
jbo: e'o ko dunda lo cidja mi .i mi xagji sai

source: What do you want me to do?
jbo: do djica lo nu mi mo

source: What's going on?
jbo: ma fasnu

source: What would happen?
jbo: va'o mo

source: What's up?
jbo: do mo

source: Have you got any baggage?
jbo: xu do bevri

source: What is missing?
jbo: ma se claxu

source: Do we have anything I can snack on?
jbo: .i xu mi nu'o citka lo cmalu

source: What is happening?
jbo: ma ca'o fasnu

source: I cried all night long.
jbo: mi pu klaku ze'a piro lo nicte

source: Are you talking to me?
jbo: xu do tavla mi

source: How many hours does it take to go to Okinawa by plane?
jbo: lo nu klama la .okinauas. fu lo vinji kei li xo cacra

source: There is a yellow rose.
jbo: va zasti fa lo pelxu rozgu

source: Mr Wang is from China.
jbo: la.uan. jungo

source: The king governed the country.
jbo: lo nolraitru cu turni lo gugde

source: Can you pass me the salt, please?
jbo: .e'o do dunda lo silna mi

source: Please pass me the salt.
jbo: .e'o ko ve pagre fi mi le silna

source: Is there any salt left?
jbo: xu vasru du'e silna

source: Please feel free to use my dictionary.
jbo: .e'u do pilno lo mi vlacku

source: How long does it take to the train station by taxi?
jbo: klama lo trene tcana fu lo taksi na'o ze'a ma

source: The man you met at the station is my father.
jbo: le nanmu poi se penmi do le tcana cu patfu mi

source: I waited for him at the station for an hour, but he didn't show up.
jbo: mi denpa tu'a ra bu'u lo tcana ze'a lo cacra .i je ku'i ra na klama

source: Can you speak English?
jbo: xu do se bangu lo glibau

source: You had to study English.
jbo: do pu bilga lo nu tadni lo glibau

source: I'm studying English.
jbo: mi tadni lo glibau

source: What do you think is the best way to learn English?
jbo: do jinvi ledu'u ma traji fo le'i xe cilre be fi le glibau

source: English is difficult, isn't it?
jbo: lo glibau cu nandu vau je'u pei

source: Answer in English.
jbo: ko spuda bau lo glibau

source: Written in English, this book is easy for me to read.
jbo: ki'u lo nu ciska bau lo glico kei lo nu tcidu lo vi cukta cu frili mi

source: Say it in English.
jbo: ko ra cusku bau lo bangenugu

source: You may swim.
jbo: .e'a do limna

source: Watching movies is very interesting.
jbo: lonu ve skina cu mutce cinri

source: I'm going to go to the movies.
jbo: mi ba klama lo kindi'u

source: The movie starts.
jbo: lo skina cu jai cfari

source: The clouds hid the sun.
jbo: lo dilnu pu mipri lo solri

source: You are lying.
jbo: do ticysku

source: It is cool after the rain.
jbo: banli tcini ba'o lo carvi

source: The rain continued all day.
jbo: pu carvi ze'a pi ro lo djedi

source: In the event of rain, the game will not be held.
jbo: .i carvi na ja nai kelci

source: When the rain stops, we'll go for a walk.
jbo: ba'a cagi co'u carvi gi cadzu i'i

source: What is the origin of the universe?
jbo: .i ma krasi lo munje

source: Take the road on the right.
jbo: ko carna fi lo pritu dargu

source: I will continue with my efforts.
jbo: mi ba co'unai troci

source: One dog and two people are jumping.
jbo: pa lo gerku e re lo prenu ca'o plipe

source: How much is the most expensive car?
jbo: ma jdima lo kargu traji karce

source: Where is the nearest bank?
jbo: lo jibni traji banxa ku zvati ma

source: Take this medicine three times a day.
jbo: ko lo micyxu'i citka ciroi lo ro djedi

source: Are you sure you've never met him?
jbo: xu do birti lo du'u do pu noroi penmi ra

source: All except one agreed to his plan.
jbo: da'a ko'a tugni fo lo selpla be ra

source: All the workers went home save one.
jbo: da'a le gunka pu zdani xruti ri

source: An old man broke into our conversation.
jbo: lo tolci'o nanmu cu zunti lo se casnu be mi'a

source: A man drew near.
jbo: lo nanmu cu jbibi'o

source: Leave me alone.
jbo: mi sepli gau ko

source: Won't you come with me?
jbo: .i xu lonu klama kei te kansa

source: Would you like to go see a movie with me?
jbo: xu do djica lonu mi'o klama lo kindi'u

source: Please sing a song.
jbo: .e'o ko sanga zo'e

source: No. I don't know. It's a lot of things.
jbo: .i na go'i .i mi na djuno .i ko'a romoi so'i zo'e

source: We use words in order to communicate.
jbo: ma'a pilno lo valsi lo nu cusku

source: Have you met her before?
jbo: xu do penmi ra pu ku

source: Is that all?
jbo: xu ta du ro da

source: A bad habit, once formed, cannot easily be got rid of.
jbo: .i sei lo xlali tcaci ba'o farvi se'u lonu ri to'e farvi kei na frili

source: It's hard to change a bad habit.
jbo: .i lonu lo xlali tcaci ku binxo kei nandu

source: It is, not I, but you, who are to blame.
jbo: .i mi na.e ku'i do .i'anai fuzme

source: That which is evil is soon learned.
jbo: .i lo girzu be loka palci kei frili selcilre

source: I take the liberty of going home.
jbo: .i mi zukte loka zifre be lonu klama be lo zdani

source: Aoi is a very good dancer.
jbo: la'oi Aoi mutce xamgu dansu

source: Burn with desire.
jbo: .i loka djica kei se fagri

source: Many murders have been committed in the name of patriotism.
jbo: so'i nu catra kei se krinu loka naijgi

source: Declare one's love.
jbo: .i noisku loka da prami

source: It is the greatest happiness in life to love and to be loved.
jbo: traji se gleki fa lo nu prami kei e lo nu se prami

source: There is more pleasure in loving than in being loved.
jbo: lo nu prami cu zmadu lo nu se prami kei lo ka pluka

source: I'm tired now.
jbo: mi ca tatpi

source: I like both dogs and cats.
jbo: mi nelci ge lo gerku gi lo mlatu

source: I swim once a week.
jbo: mi pa roi ca'o limna ca'o lo jeftu be li pa

source: I like pizza very much.
jbo: mi mutce nelci lo pitnanba

source: I am a student at Oxford University.
jbo: mi tadni bu'u la ma'urcu'e be la.aksfrd.

source: I always walk to school.
jbo: mi roroi cadzu fa'a lo ckule

source: I want to travel with you.
jbo: mi djica lo ka litru ka'ai do

source: There is a church near my house.
jbo: da malsi vi lo zdani be mi

source: London's climate differs from that of Tokyo.
jbo: la london cu frica la tokios lo ka tcima

source: The candle went out by itself.
jbo: lo laktergu'i mo'u te gusni gaunai

source: Can I buy only the lenses?
jbo: e'apei mi te vecnu loi lenjo po'o

source: Five gallons of regular, please.
jbo: li mu se likydekpu lo cnano vau e'o

source: Lucifera Vampirella is cute.
jbo: la .lusifEravampirElas. citmle

source: Lucy is a student from America.
jbo: la .lusis. noi tadni cu merko

source: Lucy is from America.
jbo: la lusis. se krasi lo mergu'e

source: I am eating an apple.
jbo: mi ca'o citka lo plise

source: How many apples?
jbo: xo plise

source: Which do you prefer, apples or bananas?
jbo: do zmadu nelci lo plise ji lo badna

source: The apples are ripe.
jbo: lo plise ku makcu

source: An apple fell off the tree.
jbo: lo plise cu farlu fi lo tricu

source: The life of Lincoln is read by children all over the world.
jbo: fe'e ro roi ku lo verba cu tcidu lo lisri be lo se lifri be la .linkon.

source: Please relax.
jbo: do e'o surla

source: Put down your name on the list and pass it on to the next person.
jbo: ko ciska le do cmene le liste gi'e dunda ly. lo lamji be do

source: Could you turn down the radio?
jbo: e'o ko cladu jdikygau lo cradi

source: Thank you in advance.
jbo: mi ckire do lo ka balvi

source: I often go to the movies.
jbo: mi klama lo kindi'u fi'o cafne

source: The European likes to drink wine.
jbo: lo ropno prenu cu nelci lo nu pinxe lo vanju

source: In short, all our efforts resulted in nothing.
jbo: to'u ro lo se troci be mi'ai pu se jalge no da

source: Have a nice day.
jbo: lo pluka ko li'i djedi

source: I wish you a Happy New Year.
jbo: gleki ke cnino nanca di'ai

source: Work slowly.
jbo: ko masno gunka

source: Slow speech is characteristic of that man.
jbo: lo masno voksa cu se ckaji lo ta nanmu

source: The rain stopped at last.
jbo: co'u za'o carvi

source: Hello, John! How are you?
jbo: coi djan do mo

source: Hi, Bill. How are you?
jbo: coi bil .i pei

source: Hi! How are you?
jbo: coi .i pei

source: Could you speak louder? I'm hard of hearing.
jbo: pe'u ko laurzengau .i mi milxe lo ka tinka'e

source: Could you put it in plain language?
jbo: .e'o xu do kakne lo ka sapcki

source: If the car breaks down, we'll walk.
jbo: va'o lo nu lo karce co'a spofu kei ma'a cadzu

source: Correct me if I am wrong.
jbo: ko cusku fi mi va'o lo nu mi srera

source: If I had had enough money, I would have bought the bag.
jbo: .i da'i mi va'o lo nu mi ponse rau jdima cu pu te vecnu lo dakli

source: Hello. This is Ogawa speaking.
jbo: coi mi'e ogauas

source: Are you there?
jbo: xu do zvati

source: Hello, I'm Tomoko Sato from Japan.
jbo: coi mi'e la tomokos satos ne lo ponjygugde

source: Hello, this is Mike.
jbo: coi mi'e maik

source: It's already ten o'clock at night.
jbo: lo cabna cu se tcika li rere .uedai

source: It's late.
jbo: lerci

source: A little louder.
jbo: cladu ke cmalu zmadu

source: Now that I'm a grownup, I think otherwise.
jbo: mi makcu .i mi drata pensi

source: Pardon me?
jbo: ki'a

source: Could you please repeat it slowly?
jbo: .e'osai do masno rapli ta

source: We tried it again, but couldn't do it.
jbo: mi'a za'u re'u troci gi'e ku'i na snada

source: It's about time for the train to arrive.
jbo: lo trene ba zi klama

source: There's nothing there.
jbo: .i nozo'e ta zvati

source: Spring will come soon.
jbo: bazi vensa

source: Try again.
jbo: ko za'ure'u troci

source: Meg talks too much.
jbo: la meg. dukse tavla

source: Have you ever been to Mexico?
jbo: xu do ba'o klama lo mexygu'e

source: They speak Spanish in Mexico.
jbo: lo spano cu bangu lo mexno

source: Mary arrived at the hospital.
jbo: la maris. pu mo'u klama lo spita

source: Mary can swim.
jbo: la.meris. kakne lo nu limna

source: Mary loses her temper easily.
jbo: la .meris. tolse'itro

source: I'm going to make a cake for Mary's birthday.
jbo: mi ba zbasu lo titnanba te fi'e lo jbedetnunsla be la.meris.

source: Everybody started waving his flag.
jbo: ro ko'a pu co'a gasnu co slilu fa lo me ko'a lanci

source: Everyone loves Mac.
jbo: ro da prami la mak

source: Please give me a glass of milk.
jbo: e'o ko dunda lo kabri be lo ladru mi

source: Not all were satisfied.
jbo: naku roda pu se mansa

source: Dinner will be ready soon.
jbo: lo vacysai zi bredi

source: Soon, he learned how to speak English.
jbo: ra pu cilre fi lo se bangu lo glico bazi

source: I hope you will call again.
jbo: mi pacna lo nu do za'ure'u fonta'a

source: See you again.
jbo: co'o

source: I hope to see you again.
jbo: mi pacna lo nu za'u re'u penmi do

source: I haven't decided yet.
jbo: mi pu'o jdice

source: Mike's mother lived in a big city before she married.
jbo: lo mamta be la.maik. cu xabju lo barda tcadu pu lo nu co'a speni

source: Mike and Ken are friends.
jbo: la maik cu pendo la ken soi vo'a

source: How are you, Mike?
jbo: pei doi maik

source: Only fifteen minutes.
jbo: mentu li su'e pamu

source: Others engage in volunteer work.
jbo: lo drata cu nalterlejgu'a

source: Look! There's a bird in that tree.
jbo: .u'e ko catlu .i lo cipni cu selvau le va tricu

source: Bob saw him again.
jbo: la bob. krefu viska ko'a

source: Almost all the workers objected to working at night.
jbo: so'a lo gunka cu fapro fi lo nu gunka ca lo nicte

source: I wish to see my father.
jbo: mi djica lo nu viska lo mi patfu

source: I neither drink nor smoke.
jbo: mi genai xalpinxe ginai tankypli

source: I don't like coffee.
jbo: mi na nelci lo ckafi

source: The ball hit her in the eye.
jbo: .i lo bolci cu janli lo kanla

source: Pass me the pen.
jbo: ko benji lo penbi mi

source: We'll paint it.
jbo: mi'ai ba cintypu'i ra

source: You wash the dishes, Ben.
jbo: do lumci lo palta doi ben

source: Do you know the capital of Belgium?
jbo: xu do djuno lo du'u makau ralju tcadu la belgium

source: I was very scared of snakes.
jbo: mi pu terpa lo since .iisai

source: Betty is a dancing teacher.
jbo: la.betis. dansu ctuca

source: Please show me how to use the headset.
jbo: e'o ko ctuca mi lo nu pilno la'o gy headset gy

source: My pet cat died yesterday.
jbo: lo mi mlatu cu mrobi'o ca lo prulamdei

source: Do your best.
jbo: ko zukte lo xagrai

source: Do you like French wines?
jbo: xu do nelci lo fraso vanju

source: French is difficult to learn.
jbo: lo nu cilre lo fasybau cu nandu

source: Brian left for New York.
jbo: la. brai,n. pu cliva se ka'a la. nu,IORK.

source: While swimming in the pool, she lost her locker key.
jbo: ca lo nu limla'u ra kei ra cirko lo ri nurta'e ckiku

source: Philip and Tom are related to each other.
jbo: la .filip. la .tam. cu ckini soi vo'a

source: May I speak to Bill?
jbo: xu mi ka'e tavla la.bil.

source: Bill often goes to the park.
jbo: la .bil. klama lo panka fi'o cafne

source: Perhaps it will rain tomorrow.
jbo: lo nu carvi ca lo bavlamdei cu cumki

source: Do you happen to know anything done by her alone?
jbo: xu do sanji lo selfi'i be ko'a po'o

source: A woman fell from a ship into the sea.
jbo: lo ninmu cu pu farlu lo xamsi lo bloti

source: I have an idea.
jbo: mi te sidbo fi da

source: The girl playing the piano is Akiko.
jbo: le nixli be sepi'o le pipno cu selcmene zoi ny. akiko .ny.

source: I need some bread and milk.
jbo: mi nitcu lo nanba je lo ladru

source: Happy Halloween!
jbo: la xalouin di'ai

source: The sound of the parade died away.
jbo: lo sance be lo dzupoi cu snucanci

source: It is not far to Paris.
jbo: na darno la.paRIZ.

source: Where is Paris?
jbo: ma se zvati la paris

source: A bee flew out of the window.
jbo: lo bifce pu vofli cliva fi lo canko

source: Will you show me your passport, please?
jbo: .e'o ko jarco lo jaspo be do

source: The bus was filled to capacity.
jbo: lo sorprekarce pu mulno culno

source: He came by bus.
jbo: ra pu klama fu lo sorprekarce

source: Fill the bucket with water.
jbo: gau ko lo baktu cu tisna lo djacu

source: Yes, it hurts.
jbo: go'i .i se cortu

source: Yes, Bob helped me.
jbo: .ie la bob. pu sidju mi

source: Yes, but it'll be difficult.
jbo: go'i .ijebo ku'i nandu

source: Yes, I do. I answered.
jbo: go'i .i mi pu spuda

source: Yes, it has already started.
jbo: go'i .i pu cai cfari

source: Yes, I am. Are you Mr Nakano?
jbo: go'i .i mi co'e .i xu do me la.nakanon.

source: Yes, I'm coming!
jbo: go'i .i mi ca'o klama

source: Here is your appointment card.
jbo: da pe do cuntu karda

source: Here are your keys.
jbo: vi ku da pe do ckiku

source: How did you like the party?
jbo: pei li'i salci

source: Will you help me prepare for the party?
jbo: xu do sidju mi lo nu bregau zi'o lo tersla

source: Among the guests invited to the party were two foreign ladies.
jbo: me lo se vi'ecpe be fi lo nunsla fa re gugyfrica ninmu

source: Don't you want to go to the party?
jbo: xu do djica lo nu klama lo tersla

source: There were more than fifty girls at the party.
jbo: za'u muno fetsi cu pu zvati le tersla

source: Can you come to the party?
jbo: pei do zvati lo te salci

source: Mrs. Parker greeted him with a smile.
jbo: la'oi .Parker. rinsa ko'a lonu cisma

source: It was a mouse.
jbo: smacu

source: Cats catch mice.
jbo: lo mlatu cu kavbu lo smacu

source: How do you like New York?
jbo: do cinmo ma la.nuiork.

source: Newton saw an apple fall off a tree.
jbo: la niut,n. viska lo nu lo plise cu farlu fi lo tricu

source: Nick hurried to catch the bus.
jbo: la .nik. pu sutra lo ka mo'u klama lo sorpeka

source: I must ask Nick his new address and telephone number when I see him.
jbo: mi bilga cpedu fi la .nik. goi ko'a fe lo ko'a xa'urjudri .e lo ko'a fonjudri ca lo nu mi ba penmi ko'a ku

source: When Nicole heard that her favorite singer had died, she burst into tears.
jbo: cazi lo nu la .nikol. goi ko'a facki lo nu lo sanga poi ko'a nelrai ke'a lo'i sanga pu mrobi'o ku ku ko'a klaku

source: Nicole can speak Japanese very well.
jbo: la .nikol. certu se ponbau

source: "How can a man be born when he is old?" Nicodemus asked.
jbo: lu .uanai lo remna poi tolci'o cu jbena ta'i ma li'u se retsku la .nikodimys.

source: Richard Nixon dropped from public attention.
jbo: sisti lo nu la .ritcardniksyn. se junri

source: I like busy places.
jbo: mi nelci lo stuzi poi tolcando

source: My brother seems to enjoy himself at college.
jbo: lo mi bruna cu simlu lo ka se pluka lo ma'urcu'e

source: For one reason or another their holiday in France didn't come up to expectations.
jbo: ki'u zo'e ko'a milxe xebni lo nalgundei be vi la .frans.

source: He had no difficulty in finding the place.
jbo: lo nu sispe'i ko'e ku frili ko'a

source: What a beautiful sunrise it is!
jbo: .u'e melbi soltolfa'u

source: How beautiful a sunrise is!
jbo: .u'e lo soltolfa'u cu melbi

source: What a beautiful garden!
jbo: .u'e melbi purdi

source: How beautiful it is!
jbo: .u'e melbi

source: How sad a story this is!
jbo: .uinai se badri lisri

source: What a mean fellow!
jbo: tolsi'a nanmu

source: What a big dog that is!
jbo: .u'e barda gerku

source: What a lovely creature!
jbo: .u'e melbi danlu

source: How wonderful this is!
jbo: .u'e

source: How considerate of you!
jbo: do pesku'i

source: How it blows!
jbo: tsali ca'erbi'e

source: How beautifully she sings!
jbo: .u'e ko'a melbi sanga

source: What a wonderful machine!
jbo: .u'e mutce xamgu minji

source: What a nice face she has!
jbo: .u'e melbi flira ra

source: What?
jbo: mo

source: How cold it is!
jbo: u'e ni lenku

source: Nancy is a capable nurse.
jbo: la nansis kakne kujmikce

source: Nancy has a piano.
jbo: la .nansin. cu ralte lo pipno

source: It's true that the project is a difficult task, but Mr Hara will be able to bring it off.
jbo: je'u le selgungunma cu nandu .i ku'i la naun.xaras. ba kakne lo ka snada mulgau

source: Why am I working hard?
jbo: mu'i ma mi mutce gunka

source: Why are you crying?
jbo: mu'i ma do klaku

source: Why?
jbo: mu'i ma

source: He asked me what I had been doing.
jbo: ra pu reisku fi mi fe losedu'u femakau mi pu zukte

source: The Nile is the longest river in the world.
jbo: la .nail. traji bo clani rirxe

source: Why do you need it?
jbo: do nitcu fi ma

source: Take whatever cake you want.
jbo: ko lebna lo titnanba poi senelci be do

source: Which is your book?
jbo: ma cukta poi do ponse

source: Tom wants to go to Japan.
jbo: la.tam. djica lo nu klama lo pongu'e

source: Tom can run fast.
jbo: la.tam. ka'e sutra bajra

source: Tom broke the window.
jbo: la .tom. pu porpi lo canko

source: "Hello," said Tom, smiling.
jbo: lu coi li'u se cusku la.tam. ca lo nu cisma

source: Tom takes good care of the birds.
jbo: la .tam. cu xamgu kurji loi cipni

source: Tom is not able to drive a car.
jbo: la .tam. na kakne lo nu lumci lo karce

source: Tom drove the car.
jbo: la .tam. pu lumci le karce

source: Tom bought a car brand-new.
jbo: la .tam. cu terve'u lo karce noi cnino

source: Tom is fitted to become a businessman.
jbo: la .tam. cu se mapti lo nu cu'upre binxo

source: Tom got a grip on his emotions.
jbo: la .tam. cu cinmo trobi'o

source: Tom feels that his team will win the game.
jbo: la .tam. cu krici lo du'u lo ri bende ba jinga

source: How fast Tom speaks!
jbo: .u'e ni la.tam. tavla sutra

source: Tom tried to climb the tall tree.
jbo: la tom troci lo nu cpare lo rajycla tricu

source: Tom is always watching television.
jbo: la.tam. ro roi zgana lo veltivni

source: Tom and Frank are good friends.
jbo: la tom e la frank cu xamgu pendo

source: How are you, Tom?
jbo: pei doi tam

source: Tommy, can you hear me?
jbo: doi .tamis. do'u xu do tirna mi

source: Which house did you live in?
jbo: do pu zdani ma

source: How did you come here?
jbo: ma velkla ti fo do

source: In any case you should come up to Tokyo.
jbo: ta'onai .e'u do klama ti po'u la .tokion.

source: Tony lives in Kobe.
jbo: la .tonis. cu xabju la .kobes.

source: Where was Tony playing then?
jbo: vi ma la.tonis. cu kelci

source: Tony did not feel poor.
jbo: la tonis na gasmlu le ka pindi

source: Which book is yours?
jbo: ma cukta poi do ponse

source: Which team is likely to win?
jbo: ma poi bende cu lakne jinga

source: Who does Toshio like?
jbo: la.toci,on. nelci ma poi prenu

source: By the way, are you free this afternoon?
jbo: xu ta'o do zifre ca lo lecydo'i

source: By the way, where does he live?
jbo: ta'o ra xabju ma

source: By the way, are you free tonight?
jbo: xu ta'o do zifre ca lo cabynicte

source: By the way, where are you from?
jbo: ta'o do jbena fo ma

source: By the way, what is the matter with him?
jbo: ta'o lo za'i ra mo cu nabmi

source: By the way, do you play the violin?
jbo: xu ta'o do zgiterca'a lo violni

source: By the way, how old are you?
jbo: ta'o do ma nanca

source: I have no idea where I left my keys.
jbo: mi na djuno lo du'u lo mi ckiku makau zvati

source: Where do you work?
jbo: do se briju fi ma

source: Where does it leave from?
jbo: cliva ma

source: Degas was born more than 150 years ago.
jbo: la degas pu jbena za lo nanca be li za'u pamuno

source: How did you come to school?
jbo: ta'i ma do klama lo ckule

source: I'm afraid she will fail.
jbo: ba'a ui nai ra fliba

source: I'm sorry.
jbo: u'u

source: "Sit down, please," he said.
jbo: do zutse e'o vau sei ra pu cusku

source: Please have a seat here.
jbo: .e'o ko ti zutse

source: Why did you run away?
jbo: seja'e ma do pu bajra to'o

source: What are you doing that for?
jbo: mu'i ma do co'e

source: What's up, Mike?
jbo: mo doi maik

source: Turn on the light, please.
jbo: .e'o ko gasnu lo nu co'a gusni

source: Turn off the light, please.
jbo: gau do e'o co'u gusni

source: Smile at me, please.
jbo: ko cisma ga'a mi vau e'o

source: Don't be so noisy, please.
jbo: e'o do na cladu sai

source: How are you doing?
jbo: pei

source: What's happening?
jbo: mo

source: Where is the toilet?
jbo: ma stuzi lo vimku'a

source: I can't remember how to say "Thank you" in German.
jbo: mi na morji lo du'u ta'i ma kau cusku lu ki'e li'u bau lo dotco

source: Shut the door.
jbo: ko ga'orgau lo vorme

source: Shut the door, will you?
jbo: ko ganlygau lo vorme vau e'o

source: The door won't close.
jbo: lo vorme na ka'e ganlo

source: Whoever is at the door, please ask him to wait.
jbo: da poi zvati lo vorme zo'u e'o ko cpedu lo nu denpa

source: Who is the girl standing at the door?
jbo: lo nixli poi sanli bu'u lo vorme cu mo

source: Let's watch TV.
jbo: e'u mi'o zgana lo veltivni

source: We take it for granted that television exists.
jbo: .i lo prenu cu jinvi co se rarna lo nu tivni

source: I'm tired of TV.
jbo: mi tatpi lo tivni

source: But I can't understand them very well.
jbo: ku'i mi no'e jimpe fi ra

source: But Dad won't like it.
jbo: ku'i la paf na ba nelci ra

source: Ted loves his wife Elizabeth.
jbo: la.ted. cu prami la.yLIzabet. noi speni vo'a

source: Clear off the table.
jbo: ko xruti lo jubme

source: There is an apple on the table.
jbo: da plise je cpana be lo jubme

source: Mr Davis looks very tired.
jbo: la .deivis. simlu lo ka mutce tatpi

source: Dick is sometimes late for school.
jbo: so'i roi lo nu la.dik. klama lo ckule cu lerci

source: In short, he is a man of great ability.
jbo: to'u ko'a me lo nanmu poi kakne lo ka se banli

source: At last, he got the car.
jbo: ba zu zo'e ra cpacu lo karce

source: Hang on a minute. I'll call Jimmy.
jbo: ko ze'i denpa .i mi klacpe la.djimis.

source: Sorry...
jbo: .u'u

source: I'll just go for a walk to clear my head.
jbo: mi cadzu mu'i lo nu .au menli surla

source: Let me see it.
jbo: .e'o mi viska

source: I've just finished lunch.
jbo: mi mo'u zi citka lo dormijysai

source: I don't have a ticket.
jbo: mi na ponse lo pikta

source: I would like to buy some cheese.
jbo: mi djica lo nu te vecnu lo cirla

source: Nobody was paying attention to her.
jbo: no da pu ca'o jundi ra
